Tekla Open API Reference for Tekla Structures 2025
Assertion Methods
The Assertion type exposes the following members.
Methods
Name | Description
Equals
 The equals.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets a hash code for this instance. Calculated as recommended at http://msdn.microsoft.com/en-us/library/system.object.gethashcode.aspx
 (Overrides Object.GetHashCode().)
ToString
 The tostring.
 (Overrides Object.ToString().)
Top
See Also
Reference
Assertion Class
Tekla.Structures Namespace